app/controllers/boarding_documents_controller.rb

  def index
    @boarding_documents = BoardingDocument.all
---
SELECT "boarding_documents".* FROM "boarding_documents"