app/controllers/manage_users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."email" ASC
---
  def index
    @users = User.order(:email).all

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2, "user_signature" = $3 WHERE "users"."id" = 24  [["encrypted_password", "$2a$10$nFiwCYbp0nlp0ZRppBAa9O9B6R8XcrKm28oJwuqez6cGy7i.dP2OC"], ["updated_at", "2015-06-03 11:54:08.620221"], ["user_signature", "user2.png"]]
---
  def update
    @user.email = manage_user_params[:email]
    @user.password = manage_user_params[:password]
    upload_file_path = User.upload_file(manage_user_params[:upload_file])
    @user.user_signature = upload_file_path ? upload_file_path : nil

    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = 17  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_manage_user
      @user = User.find(params[:id])